<a href="https://colab.research.google.com/github/ValdazoAmerico/random-forest-regression/blob/main/random-forest-regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [2]:
tips_df = sns.load_dataset('tips')
tips_df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
X = tips_df.drop(['tip'],axis=1)
y = tips_df['tip']
X.head()

   total_bill     sex smoker  day    time  size
0       16.99  Female     No  Sun  Dinner     2
1       10.34    Male     No  Sun  Dinner     3
2       21.01    Male     No  Sun  Dinner     3
3       23.68    Male     No  Sun  Dinner     2
4       24.59  Female     No  Sun  Dinner     4

In [4]:
y.head()

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

In [5]:
#Nos quedamos con las columnas que tengan valores numericos
numerical = X.drop(['sex','smoker','day','time'],axis=1)

In [9]:
categorical = X.filter(['sex','smoker','day','time'])
categorical.head()

      sex smoker  day    time
0  Female     No  Sun  Dinner
1    Male     No  Sun  Dinner
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner

In [10]:
#Convertimos los valores a One hot encoding
cat_numerical = pd.get_dummies(categorical,drop_first=True)
cat_numerical.head()

   sex_Female  smoker_No  day_Fri  day_Sat  day_Sun  time_Dinner
0           1          1        0        0        1            1
1           0          1        0        0        1            1
2           0          1        0        0        1            1
3           0          1        0        0        1            1
4           1          1        0        0        1            1

In [11]:
#Concatenamos el dataframe de valores numericos y el dataframe de one hot encoding
X = pd.concat([numerical, cat_numerical], axis=1)
X.head()

   total_bill  size  sex_Female  ...  day_Sat  day_Sun  time_Dinner
0       16.99     2           1  ...        0        1            1
1       10.34     3           0  ...        0        1            1
2       21.01     3           0  ...        0        1            1
3       23.68     2           0  ...        0        1            1
4       24.59     4           1  ...        0        1            1

[5 rows x 8 columns]

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=20, random_state=0)

In [14]:
#Normalizamos los datos
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [15]:
#Entrenamos con RandomForest
from sklearn.ensemble import RandomForestRegressor
rf_reg = RandomForestRegressor(random_state=42, n_estimators=500)
regressor = rf_reg.fit(X_train,y_train)
y_pred = regressor.predict(X_test)

In [16]:
#Evaluamos la performance del algoritmo
from sklearn import metrics

print("Mean Absolute Error:", metrics.mean_absolute_error(y_test,y_pred))

print("Mean Squared Error:", metrics.mean_squared_error(y_test,y_pred))

print("Root Mean Squared Error:", np.sqrt(metrics.mean_squared_error(y_test,y_pred)))

Mean Absolute Error: 0.7655139999999999
Mean Squared Error: 0.9887363050400045
Root Mean Squared Error: 0.9943522037185841